RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_can.c
/*
 * File      : drv_can.c
 * This file is part of RT-Thread RTOS
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author               Notes
 * 2025-18-03     Dmitriy Chernov      first implementation for GD32F4xx
 * 2025-09-24     CYFS                 add support for GD32F5xx
 * 2026-01-28     WangShun             support gd32f5xx csp
 */

#include "drv_can.h"
#include "can_config.h"
#include "string.h"

#ifdef RT_USING_CAN

#define LOG_TAG    "can_drv"
#include <drv_log.h>

#if defined(GD32F405) || defined(GD32F407) /* 42MHz(max) */
static const struct gd32_baudrate_tbl can_baudrate_tbl[] =
{
    {CAN1MBaud,     CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 3},
    {CAN800kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 5},
    {CAN500kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 6},
    {CAN250kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 12},
    {CAN125kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 24},
    {CAN100kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 30},
    {CAN50kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 60},
    {CAN20kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 150},
    {CAN10kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_11TQ, CAN_BT_BS2_2TQ, 300},
};
#elif defined(GD32F425) || defined(GD32F427) || defined(GD32F450) || defined(SOC_SERIES_GD32F5xx)/* 50MHz(max) */
static const struct gd32_baudrate_tbl can_baudrate_tbl[] =
{
    {CAN1MBaud,     CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 5},
    {CAN800kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_12TQ, CAN_BT_BS2_2TQ, 4},
    {CAN500kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 10},
    {CAN250kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 20},
    {CAN125kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 40},
    {CAN100kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 50},
    {CAN50kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 100},
    {CAN20kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 250},
    {CAN10kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_8TQ,  CAN_BT_BS2_1TQ, 500},
};
#elif defined(GD32F470) /* 60MHz(max) */
static const struct gd32_baudrate_tbl can_baudrate_tbl[] =
{
    {CAN1MBaud,     CAN_BT_SJW_1TQ, CAN_BT_BS1_12TQ, CAN_BT_BS2_2TQ, 4},
    {CAN800kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_12TQ, CAN_BT_BS2_2TQ, 5},
    {CAN500kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_12TQ, CAN_BT_BS2_2TQ, 8},
    {CAN250kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_13TQ, CAN_BT_BS2_2TQ, 15},
    {CAN125kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_13TQ, CAN_BT_BS2_2TQ, 30},
    {CAN100kBaud,   CAN_BT_SJW_1TQ, CAN_BT_BS1_12TQ, CAN_BT_BS2_2TQ, 40},
    {CAN50kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_13TQ, CAN_BT_BS2_2TQ, 75},
    {CAN20kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_13TQ, CAN_BT_BS2_2TQ, 200},
    {CAN10kBaud,    CAN_BT_SJW_1TQ, CAN_BT_BS1_13TQ, CAN_BT_BS2_2TQ, 375},
};
#else
    #error "CAN driver not implemented for selected device"
#endif

#ifdef BSP_USING_CAN0
static struct gd32_can_device dev_can0 =
{
    .name = "can0",
    .can_x = CAN0,
};
#endif

#ifdef BSP_USING_CAN1
static struct gd32_can_device dev_can1 =
{
    "can1",
    .can_x = CAN1,
};
#endif

static gd32_can_struct can_obj[] =
{
#ifdef BSP_USING_CAN0
    CAN0_CONFIG,
#endif
#ifdef BSP_USING_CAN1
    CAN1_CONFIG,
#endif
};

static void gd32_can_gpio_init(void)
{
    int i;
    rt_uint32_t tx_port, rx_port;
    rt_uint32_t tx_pin, rx_pin;
    rt_uint32_t pin_af;
    rcu_periph_enum tx_periph, rx_periph;

#ifdef BSP_USING_CAN0
    rcu_periph_clock_enable(RCU_CAN0);
#endif

#ifdef BSP_USING_CAN1
    rcu_periph_clock_enable(RCU_CAN1);
#endif

#ifdef BSP_USING_CAN2
    rcu_periph_clock_enable(RCU_CAN2);
#endif

    for (i = 0; i < sizeof(can_obj) / sizeof(can_obj[0]); i++)
    {
        get_pin_config(can_obj[i].tx_pin_name, &tx_port, &tx_pin, &tx_periph);
        get_pin_config(can_obj[i].rx_pin_name, &rx_port, &rx_pin, &rx_periph);
        pin_alternate_config(can_obj[i].alternate, &pin_af);

        rcu_periph_clock_enable(tx_periph);
        rcu_periph_clock_enable(rx_periph);

        gpio_output_options_set(tx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, tx_pin);
        gpio_mode_set(tx_port, GPIO_MODE_AF, GPIO_PUPD_NONE, tx_pin);
        gpio_af_set(tx_port, pin_af, tx_pin);

        gpio_output_options_set(rx_port, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, rx_pin);
        gpio_mode_set(rx_port, GPIO_MODE_AF, GPIO_PUPD_NONE, rx_pin);
        gpio_af_set(rx_port, pin_af, rx_pin);
    }
}

static rt_uint32_t get_can_baudrate_index(rt_uint32_t baudrate)
{
    rt_uint32_t len = sizeof(can_baudrate_tbl) / sizeof(can_baudrate_tbl[0]);
    for (rt_uint32_t index = 0; index < len; index++)
    {
        if (can_baudrate_tbl[index].baudrate == baudrate)
        {
            return index;
        }
    }

    return 0; /* default baudrate is CAN1MBaud */
}

static rt_err_t _can_config(struct rt_can_device *can, struct can_configure *cfg)
{
    can_parameter_struct can_init_struct;
    can_struct_para_init(CAN_INIT_STRUCT, &can_init_struct);

    RT_ASSERT(can);
    RT_ASSERT(cfg);
    struct gd32_can_device *can_dev = (struct gd32_can_device *)can->parent.user_data;
    RT_ASSERT(can_dev != RT_NULL);

    can_deinit(can_dev->can_x);

    can_init_struct.time_triggered = DISABLE;
    can_init_struct.auto_bus_off_recovery = ENABLE;
    can_init_struct.auto_wake_up = ENABLE;
    can_init_struct.auto_retrans = DISABLE;
    can_init_struct.rec_fifo_overwrite = DISABLE;
    can_init_struct.trans_fifo_order = DISABLE;

    switch (cfg->mode)
    {
    case RT_CAN_MODE_NORMAL:
        can_init_struct.working_mode = CAN_NORMAL_MODE;
        break;
    case RT_CAN_MODE_LISTEN:
        can_init_struct.working_mode = CAN_SILENT_MODE;
        break;
    case RT_CAN_MODE_LOOPBACK:
        can_init_struct.working_mode = CAN_LOOPBACK_MODE;
        break;
    case RT_CAN_MODE_LOOPBACKANLISTEN:
        can_init_struct.working_mode = CAN_SILENT_LOOPBACK_MODE;
        break;
    }

    rt_uint32_t baudrate_index = get_can_baudrate_index(cfg->baud_rate);
    can_init_struct.resync_jump_width = can_baudrate_tbl[baudrate_index].sjw;
    can_init_struct.time_segment_1 = can_baudrate_tbl[baudrate_index].tseg1;
    can_init_struct.time_segment_2 = can_baudrate_tbl[baudrate_index].tseg2;
    can_init_struct.prescaler = can_baudrate_tbl[baudrate_index].prescaler;
    if (can_init(can_dev->can_x, &can_init_struct) != SUCCESS)
    {
        return -RT_ERROR;
    }

    can_filter_init(&can_dev->filter_config);

