RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_can.c
    return RT_EOK;
}

static rt_err_t _can_control(struct rt_can_device *can, int cmd, void *arg)
{
    rt_uint32_t argval;
    struct rt_can_filter_config *filter_cfg;

    RT_ASSERT(can != RT_NULL);
    struct gd32_can_device *can_dev = (struct gd32_can_device *)can->parent.user_data;
    RT_ASSERT(can_dev != RT_NULL);

    switch (cmd)
    {
    case RT_DEVICE_CTRL_CLR_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
#ifdef CAN0
            if (CAN0 == can_dev->can_x)
            {
                nvic_irq_disable(CAN0_RX0_IRQn);
                nvic_irq_disable(CAN0_RX1_IRQn);
            }
#endif
#ifdef CAN1
            if (CAN1 == can_dev->can_x)
            {
                nvic_irq_disable(CAN1_RX0_IRQn);
                nvic_irq_disable(CAN1_RX1_IRQn);
            }
#endif
            can_interrupt_disable(can_dev->can_x, CAN_INT_RFNE0);
            can_interrupt_disable(can_dev->can_x, CAN_INT_RFF0);
            can_interrupt_disable(can_dev->can_x, CAN_INT_RFO0);
            can_interrupt_disable(can_dev->can_x, CAN_INT_RFNE1);
            can_interrupt_disable(can_dev->can_x, CAN_INT_RFF1);
            can_interrupt_disable(can_dev->can_x, CAN_INT_RFO1);
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
#ifdef CAN0
            if (CAN0 == can_dev->can_x)
            {
                nvic_irq_disable(CAN0_TX_IRQn);
            }
#endif
#ifdef CAN1
            if (CAN1 == can_dev->can_x)
            {
                nvic_irq_disable(CAN1_TX_IRQn);
            }
#endif
            can_interrupt_disable(can_dev->can_x, CAN_INT_TME);
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
#ifdef CAN0
            if (CAN0 == can_dev->can_x)
            {
                nvic_irq_disable(CAN0_EWMC_IRQn);
            }
#endif
#ifdef CAN1
            if (CAN1 == can_dev->can_x)
            {
                nvic_irq_disable(CAN1_EWMC_IRQn);
            }
#endif
            can_interrupt_disable(can_dev->can_x, CAN_INT_WERR);
            can_interrupt_disable(can_dev->can_x, CAN_INT_PERR);
            can_interrupt_disable(can_dev->can_x, CAN_INT_BO);
            can_interrupt_disable(can_dev->can_x, CAN_INT_ERRN);
            can_interrupt_disable(can_dev->can_x, CAN_INT_ERR);
        }
        break;
    case RT_DEVICE_CTRL_SET_INT:
        argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
            can_interrupt_enable(can_dev->can_x, CAN_INT_RFNE0);
            can_interrupt_enable(can_dev->can_x, CAN_INT_RFF0);
            can_interrupt_enable(can_dev->can_x, CAN_INT_RFO0);
            can_interrupt_enable(can_dev->can_x, CAN_INT_RFNE1);
            can_interrupt_enable(can_dev->can_x, CAN_INT_RFF1);
            can_interrupt_enable(can_dev->can_x, CAN_INT_RFO1);
#ifdef CAN0
            if (CAN0 == can_dev->can_x)
            {
                nvic_irq_enable(CAN0_RX0_IRQn, 1, 0);
                nvic_irq_enable(CAN0_RX1_IRQn, 1, 0);
            }
#endif
#ifdef CAN1
            if (CAN1 == can_dev->can_x)
            {
                nvic_irq_enable(CAN1_RX0_IRQn, 1, 0);
                nvic_irq_enable(CAN1_RX1_IRQn, 1, 0);
            }
#endif
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            can_interrupt_enable(can_dev->can_x, CAN_INT_TME);
#ifdef CAN0
            if (CAN0 == can_dev->can_x)
            {
                nvic_irq_enable(CAN0_TX_IRQn, 1, 0);
            }
#endif
#ifdef CAN1
            if (CAN1 == can_dev->can_x)
            {
                nvic_irq_enable(CAN1_TX_IRQn, 1, 0);
            }
#endif
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            can_interrupt_enable(can_dev->can_x, CAN_INT_WERR);
            can_interrupt_enable(can_dev->can_x, CAN_INT_PERR);
            can_interrupt_enable(can_dev->can_x, CAN_INT_BO);
            can_interrupt_enable(can_dev->can_x, CAN_INT_ERRN);
            can_interrupt_enable(can_dev->can_x, CAN_INT_ERR);
#ifdef CAN0
            if (CAN0 == can_dev->can_x)
            {
                nvic_irq_enable(CAN0_EWMC_IRQn, 1, 0);
            }
#endif
#ifdef CAN1
            if (CAN1 == can_dev->can_x)
            {
                nvic_irq_enable(CAN1_EWMC_IRQn, 1, 0);
            }
#endif
        }
        break;
    case RT_CAN_CMD_SET_FILTER:
    {
        rt_uint32_t id_h = 0;
        rt_uint32_t id_l = 0;
        rt_uint32_t mask_h = 0;
        rt_uint32_t mask_l = 0;
        rt_uint32_t mask_l_tail = 0;  /*CAN_FxR2 bit [2:0]*/

        if (RT_NULL == arg)
        {
            /* default filter config */
            can_filter_init(&can_dev->filter_config);
        }
        else
        {
            filter_cfg = (struct rt_can_filter_config *)arg;
            /* get default filter */
            for (int i = 0; i < filter_cfg->count; i++)
            {
                if (filter_cfg->items[i].hdr_bank == -1)
                {
                    /* use default filter bank settings */
                    if (rt_strcmp(can_dev->name, "can0") == 0)
                    {
                        /* can0 banks 0~13 */
                        can_dev->filter_config.filter_number = i;
#ifdef RT_CAN_USING_HDR
                        filter_cfg->items[i].hdr_bank = i;
#endif
                    }
                    else if (rt_strcmp(can_dev->name, "can1") == 0)
                    {
                        /* can1 banks 14~27 */
                        can_dev->filter_config.filter_number = i + 14;
#ifdef RT_CAN_USING_HDR
                        filter_cfg->items[i].hdr_bank = i + 14;
#endif
                    }
                }
                else
                {
                    /* use user-defined filter bank settings */
                    can_dev->filter_config.filter_number = filter_cfg->items[i].hdr_bank;
                }

                if (filter_cfg->items[i].mode == CAN_FILTERMODE_MASK)
                {
                    mask_l_tail = 0x06;
                }
                else if (filter_cfg->items[i].mode == CAN_FILTERMODE_LIST)
                {
                    mask_l_tail = (filter_cfg->items[i].ide << 2) |
                                  (filter_cfg->items[i].rtr << 1);
                }

                if (filter_cfg->items[i].ide == RT_CAN_STDID)
                {
                    id_h = ((filter_cfg->items[i].id << 18) >> 13) & 0xFFFF;
                    id_l = ((filter_cfg->items[i].id << 18) |
                            (filter_cfg->items[i].ide << 2) |
                            (filter_cfg->items[i].rtr << 1)) & 0xFFFF;
                    mask_h = ((filter_cfg->items[i].mask << 21) >> 16) & 0xFFFF;
                    mask_l = ((filter_cfg->items[i].mask << 21) | mask_l_tail) & 0xFFFF;
                }
                else if (filter_cfg->items[i].ide == RT_CAN_EXTID)
                {
                    id_h = (filter_cfg->items[i].id >> 13) & 0xFFFF;
                    id_l = ((filter_cfg->items[i].id << 3)   |
                            (filter_cfg->items[i].ide << 2)  |
                            (filter_cfg->items[i].rtr << 1)) & 0xFFFF;
                    mask_h = ((filter_cfg->items[i].mask << 3) >> 16) & 0xFFFF;
                    mask_l = ((filter_cfg->items[i].mask << 3) | mask_l_tail) & 0xFFFF;
                }
                can_dev->filter_config.filter_list_high = id_h;
                can_dev->filter_config.filter_list_low = id_l;
                can_dev->filter_config.filter_mask_high = mask_h;
                can_dev->filter_config.filter_mask_low = mask_l;

                can_dev->filter_config.filter_mode = filter_cfg->items[i].mode;
                can_dev->filter_config.filter_fifo_number = filter_cfg->items[i].rxfifo;/*rxfifo = CAN_RX_FIFO0/CAN_RX_FIFO1*/
                /* Filter conf */
                can_filter_init(&can_dev->filter_config);
            }
        }
        break;
    }
    case RT_CAN_CMD_SET_MODE:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_NORMAL &&
            argval != RT_CAN_MODE_LISTEN &&
            argval != RT_CAN_MODE_LOOPBACK &&
            argval != RT_CAN_MODE_LOOPBACKANLISTEN)
        {
            return -RT_ERROR;
        }

        if (argval != can_dev->device.config.mode)
        {
            can_dev->device.config.mode = argval;
            return _can_config(&can_dev->device, &can_dev->device.config);
        }
        break;
    case RT_CAN_CMD_SET_BAUD:
        argval = (rt_uint32_t) arg;
        if (argval != CAN1MBaud &&
                argval != CAN800kBaud &&
                argval != CAN500kBaud &&
                argval != CAN250kBaud &&
                argval != CAN125kBaud &&
                argval != CAN100kBaud &&
                argval != CAN50kBaud  &&
                argval != CAN20kBaud  &&
                argval != CAN10kBaud)
        {
            return -RT_ERROR;
        }

