RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_can.c
        if (argval != can_dev->device.config.baud_rate)
        {
            can_dev->device.config.baud_rate = argval;
            return _can_config(&can_dev->device, &can_dev->device.config);
        }
        break;
    case RT_CAN_CMD_SET_PRIV:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_PRIV &&
                argval != RT_CAN_MODE_NOPRIV)
        {
            return -RT_ERROR;
        }

        if (argval != can_dev->device.config.privmode)
        {
            can_dev->device.config.privmode = argval;
            return _can_config(&can_dev->device, &can_dev->device.config);
        }
        break;
    case RT_CAN_CMD_GET_STATUS:
    {
        rt_uint32_t errtype;
        errtype = CAN_STAT(can_dev->can_x);
        can_dev->device.status.rcverrcnt = errtype >> 24;
        can_dev->device.status.snderrcnt = (errtype >> 16 & 0xFF);
        can_dev->device.status.lasterrtype = errtype & 0x70;
        can_dev->device.status.errcode = errtype & 0x07;

        rt_memcpy(arg, &can_dev->device.status, sizeof(can_dev->device.status));
        break;
    }
    }

    return RT_EOK;
}

static rt_ssize_t _can_sendmsg(struct rt_can_device *can, const void *buf, rt_uint32_t box_num)
{
    RT_ASSERT(can);

    can_trasnmit_message_struct transmit_message;
    can_struct_para_init(CAN_TX_MESSAGE_STRUCT, &transmit_message);
    rt_uint32_t can_x = ((struct gd32_can_device *)can->parent.user_data)->can_x;
    struct rt_can_msg *pmsg = (struct rt_can_msg *)buf;

    switch (box_num)
    {
    case CAN_MAILBOX0:
        if (!CAN_STAT(can_x) & CAN_TSTAT_TME0)
        {
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    case CAN_MAILBOX1:
        if (!CAN_STAT(can_x) & CAN_TSTAT_TME1)
        {
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    case CAN_MAILBOX2:
        if (!CAN_STAT(can_x) & CAN_TSTAT_TME2)
        {
            /* Return function status */
            return -RT_ERROR;
        }
        break;
    default:
        RT_ASSERT(0);
        break;
    }

    if (RT_CAN_STDID == pmsg->ide)
    {
        transmit_message.tx_ff = CAN_FF_STANDARD;
        transmit_message.tx_sfid = pmsg->id;
    }
    else
    {
        transmit_message.tx_ff = CAN_FF_EXTENDED;
        transmit_message.tx_efid = pmsg->id;
    }

    if (RT_CAN_DTR == pmsg->rtr)
    {
        transmit_message.tx_ft = CAN_FT_DATA;
        memcpy(transmit_message.tx_data, pmsg->data, pmsg->len);
    }
    else
    {
        transmit_message.tx_ft = CAN_FT_REMOTE;
    }

    transmit_message.tx_dlen = pmsg->len;

    CAN_TMI(can_x, box_num) &= CAN_TMI_TEN;

    if (RT_CAN_STDID == pmsg->ide)
    {
        CAN_TMI(can_x, box_num) |= (uint32_t)(TMI_SFID(transmit_message.tx_sfid) | \
                                    transmit_message.tx_ft);
    }
    else
    {
        CAN_TMI(can_x, box_num) |= (uint32_t)(TMI_EFID(transmit_message.tx_efid) | \
                                    transmit_message.tx_ff | \
                                    transmit_message.tx_ft);
    }
    CAN_TMP(can_x, box_num) &= ~CAN_TMP_DLENC;
    CAN_TMP(can_x, box_num) |= transmit_message.tx_dlen;

    CAN_TMDATA0(can_x, box_num) = TMDATA0_DB3(transmit_message.tx_data[3]) | \
    TMDATA0_DB2(transmit_message.tx_data[2]) | \
    TMDATA0_DB1(transmit_message.tx_data[1]) | \
    TMDATA0_DB0(transmit_message.tx_data[0]);
    CAN_TMDATA1(can_x, box_num) = TMDATA1_DB7(transmit_message.tx_data[7]) | \
    TMDATA1_DB6(transmit_message.tx_data[6]) | \
    TMDATA1_DB5(transmit_message.tx_data[5]) | \
    TMDATA1_DB4(transmit_message.tx_data[4]);

    CAN_TMI(can_x, box_num) |= CAN_TMI_TEN;

    return RT_EOK;
}

static rt_ssize_t _can_recvmsg(struct rt_can_device *can, void *buf, rt_uint32_t fifo)
{
    RT_ASSERT(can);

    can_receive_message_struct receive_message;
    can_struct_para_init(CAN_RX_MESSAGE_STRUCT, &receive_message);
    rt_uint32_t can_x = ((struct gd32_can_device *)can->parent.user_data)->can_x;
    struct rt_can_msg *pmsg = (struct rt_can_msg *)buf;

    can_message_receive(can_x, fifo, &receive_message);

    if (receive_message.rx_ff == CAN_FF_STANDARD)
    {
        pmsg->ide = RT_CAN_STDID;
        pmsg->id = receive_message.rx_sfid;
    }
    else
    {
        pmsg->ide = RT_CAN_EXTID;
        pmsg->id = receive_message.rx_efid;
    }

    if (receive_message.rx_ft == CAN_FT_DATA)
    {
        pmsg->rtr = RT_CAN_DTR;
        memcpy(pmsg->data, receive_message.rx_data, receive_message.rx_dlen);
    }
    else
    {
        pmsg->rtr = RT_CAN_RTR;
    }
    pmsg->rxfifo = fifo;

    pmsg->len = receive_message.rx_dlen;

#ifdef CAN1
    if (can_x == CAN1)
    {
        pmsg->hdr_index = receive_message.rx_fi;
    }
#endif
#ifdef CAN2
    if (can_x == CAN2)
    {
       pmsg->hdr_index = receive_message.rx_fi;
    }
#endif

    return RT_EOK;
}

rt_ssize_t _can_get_freebox(rt_uint32_t can_x)
{
    rt_uint32_t freebox = 0;
    if ((CAN_STAT(can_x) & CAN_TSTAT_TME0) != 0U)
    {
        freebox++;
    }

    if ((CAN_STAT(can_x) & CAN_TSTAT_TME1) != 0U)
    {
        freebox++;
    }

    if ((CAN_STAT(can_x) & CAN_TSTAT_TME2) != 0U)
    {
        freebox++;
    }
    return freebox;
}

rt_ssize_t _can_sendmsg_nonblocking(struct rt_can_device *can, const void *buf)
{
    RT_ASSERT(can);

    can_trasnmit_message_struct transmit_message;
    can_struct_para_init(CAN_TX_MESSAGE_STRUCT, &transmit_message);
    rt_uint32_t can_x = ((struct gd32_can_device *)can->parent.user_data)->can_x;
    struct rt_can_msg *pmsg = (struct rt_can_msg *)buf;

    if(_can_get_freebox(can_x) == 0)
    {
        return -RT_EBUSY;
    }

    if (RT_CAN_STDID == pmsg->ide)
    {
        transmit_message.tx_ff = CAN_FF_STANDARD;
        transmit_message.tx_sfid = pmsg->id;
    }
    else
    {
        transmit_message.tx_ff = CAN_FF_EXTENDED;
        transmit_message.tx_efid = pmsg->id;
    }

    if (RT_CAN_DTR == pmsg->rtr)
    {
        transmit_message.tx_ft = CAN_FT_DATA;
        memcpy(transmit_message.tx_data, pmsg->data, pmsg->len);
    }
    else
    {
        transmit_message.tx_ft = CAN_FT_REMOTE;
    }

    transmit_message.tx_dlen = pmsg->len;
    if(can_message_transmit(can_x, &transmit_message) == CAN_NOMAILBOX)
    {
        return -RT_ERROR;
    }

