RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_can.c
    return RT_EOK;
}

static const struct rt_can_ops _can_ops =
{
    _can_config,
    _can_control,
    _can_sendmsg,
    _can_recvmsg,
    _can_sendmsg_nonblocking,
};

static void _can_rx_isr(struct rt_can_device *can, rt_uint32_t fifo)
{
    RT_ASSERT(can);
    rt_uint32_t can_x = ((struct gd32_can_device *)can->parent.user_data)->can_x;

    switch (fifo)
    {
    case CAN_RX_FIFO0:
        /* save to user list */
        if (can_receive_message_length_get(can_x, CAN_RX_FIFO0) && can_interrupt_flag_get(can_x, CAN_INT_FLAG_RFL0))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
        }
        /* Check FULL flag for FIFO0 */
        if (can_flag_get(can_x, CAN_FLAG_RFF0) && can_interrupt_flag_get(can_x, CAN_INT_FLAG_RFF0))
        {
            /* Clear FIFO0 FULL Flag */
            can_flag_clear(can_x, CAN_INT_FLAG_RFF0);
        }

        /* Check Overrun flag for FIFO0 */
        if (can_flag_get(can_x, CAN_FLAG_RFO0) && can_interrupt_flag_get(can_x, CAN_INT_FLAG_RFO0))
        {
            /* Clear FIFO0 Overrun Flag */
            can_flag_clear(can_x, CAN_INT_FLAG_RFO0);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }
        break;
    case CAN_RX_FIFO1:
        /* save to user list */
        if (can_receive_message_length_get(can_x, CAN_RX_FIFO1) && can_interrupt_flag_get(can_x, CAN_INT_FLAG_RFL1))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
        }
        /* Check FULL flag for FIFO0 */
        if (can_flag_get(can_x, CAN_FLAG_RFF1) && can_interrupt_flag_get(can_x, CAN_INT_FLAG_RFF1))
        {
            /* Clear FIFO0 FULL Flag */
            can_interrupt_flag_clear(can_x, CAN_INT_FLAG_RFF1);
        }

        /* Check Overrun flag for FIFO0 */
        if (can_flag_get(can_x, CAN_FLAG_RFO0) && can_interrupt_flag_get(can_x, CAN_INT_FLAG_RFO0))
        {
            /* Clear FIFO0 Overrun Flag */
            can_interrupt_flag_clear(can_x, CAN_INT_FLAG_RFO1);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }
        break;
    }
}

static void _can_ewmc_isr(struct rt_can_device *can)
{
    RT_ASSERT(can);
    rt_uint32_t can_x = ((struct gd32_can_device *)can->parent.user_data)->can_x;
    rt_uint32_t errtype = CAN_ERR(can_x);

    switch ((errtype & 0x70) >> 4)
    {
        case RT_CAN_BUS_BIT_PAD_ERR:
            can->status.bitpaderrcnt++;
            break;
        case RT_CAN_BUS_FORMAT_ERR:
            can->status.formaterrcnt++;
            break;
        case RT_CAN_BUS_ACK_ERR:/* attention !!! test ack err's unit is transmit unit */
            can->status.ackerrcnt++;
            if (can_interrupt_flag_get(can_x, CAN_INT_FLAG_MTF0))
            {
                if (!can_flag_get(can_x, CAN_FLAG_MTFNERR0))
                {
                    rt_hw_can_isr(can, RT_CAN_EVENT_TX_FAIL | 0 << 8);
                }
                can_interrupt_flag_clear(can_x, CAN_INT_FLAG_MTF0);
            }
            else if (can_interrupt_flag_get(can_x, CAN_INT_FLAG_MTF1))
            {
                if (!can_flag_get(can_x, CAN_FLAG_MTFNERR1))
                {
                    rt_hw_can_isr(can, RT_CAN_EVENT_TX_FAIL | 1 << 8);
                }
                can_interrupt_flag_clear(can_x, CAN_INT_FLAG_MTF1);
            }
            else if (can_interrupt_flag_get(can_x, CAN_INT_FLAG_MTF2))
            {
                if (!can_flag_get(can_x, CAN_FLAG_MTFNERR2))
                {
                    rt_hw_can_isr(can, RT_CAN_EVENT_TX_FAIL | 2 << 8);
                }
                can_interrupt_flag_clear(can_x, CAN_INT_FLAG_MTF2);
            }
            else
            {
                if (can_interrupt_flag_get(can_x, CAN_FLAG_MTE0))/*IF AutoRetransmission = ENABLE,ACK ERR handler*/
                {
                    CAN_TSTAT(can_x) |= CAN_TSTAT_MST0;/*Abort the send request, trigger the TX interrupt,release completion quantity*/
                }
                else if (can_interrupt_flag_get(can_x, CAN_FLAG_MTE1))
                {
                    CAN_TSTAT(can_x) |= CAN_TSTAT_MST1;
                }
                else if (can_interrupt_flag_get(can_x, CAN_FLAG_MTE2))
                {
                    CAN_TSTAT(can_x) |= CAN_TSTAT_MST2;
                }
            }
            break;
        case RT_CAN_BUS_IMPLICIT_BIT_ERR:
        case RT_CAN_BUS_EXPLICIT_BIT_ERR:
            can->status.biterrcnt++;
            break;
        case RT_CAN_BUS_CRC_ERR:
            can->status.crcerrcnt++;
            break;
    }

    can->status.lasterrtype = errtype & 0x70;
    can->status.rcverrcnt = errtype >> 24;
    can->status.snderrcnt = (errtype >> 16 & 0xFF);
    can->status.errcode = errtype & 0x07;
    CAN_STAT(can_x) |= CAN_STAT_ERRIF;
}

static void _can_tx_isr(struct rt_can_device *can)
{
    RT_ASSERT(can);
    rt_uint32_t can_x = ((struct gd32_can_device *)can->parent.user_data)->can_x;

    if (can_interrupt_flag_get(can_x, CAN_INT_FLAG_MTF0))
    {
        if (can_flag_get(can_x, CAN_FLAG_MTFNERR0))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_TX_DONE | 0 << 8);
        }
        else
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_TX_FAIL | 0 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        can_interrupt_flag_clear(can_x, CAN_INT_FLAG_MTF0);
    }
    else if (can_interrupt_flag_get(can_x, CAN_INT_FLAG_MTF1))
    {
        if (can_flag_get(can_x, CAN_FLAG_MTFNERR1))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_TX_DONE | 1 << 8);
        }
        else
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_TX_FAIL | 1 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        can_interrupt_flag_clear(can_x, CAN_INT_FLAG_MTF1);
    }
    else if (can_interrupt_flag_get(can_x, CAN_INT_FLAG_MTF2))
    {
        if (can_flag_get(can_x, CAN_FLAG_MTFNERR2))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_TX_DONE | 2 << 8);
        }
        else
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_TX_FAIL | 2 << 8);
        }
        /* Write 0 to Clear transmission status flag RQCPx */
        can_interrupt_flag_clear(can_x, CAN_INT_FLAG_MTF2);
    }
}

#ifdef BSP_USING_CAN0
/**
 * @brief This function handles CAN0 TX interrupts. transmit fifo0/1/2 is empty can trigger this interrupt
 */
void CAN0_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_tx_isr(&dev_can0.device);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN0 RX0 interrupts.
 */
void CAN0_RX0_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&dev_can0.device, CAN_RX_FIFO0);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN0 RX1 interrupts.
 */
void CAN0_RX1_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&dev_can0.device, CAN_RX_FIFO1);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN0 EWMC interrupts.
 */
void CAN0_EWMC_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_ewmc_isr(&dev_can0.device);
    rt_interrupt_leave();
}
#endif /* BSP_USING_CAN0 */

