RT-Thread-Studio/sdk-csp-gd32f5/drivers/rtt/drv_can.c
#ifdef BSP_USING_CAN1
/**
 * @brief This function handles CAN1 TX interrupts.
 */
void CAN1_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_tx_isr(&dev_can1.device);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX0 interrupts.
 */
void CAN1_RX0_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&dev_can1.device, CAN_RX_FIFO0);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX1 interrupts.
 */
void CAN1_RX1_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&dev_can1.device, CAN_RX_FIFO1);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 EWMC interrupts.
 */
void CAN1_EWMC_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_ewmc_isr(&dev_can1.device);
    rt_interrupt_leave();
}
#endif /* BSP_USING_CAN1 */

/* void HAL_CAN_ErrorCallback(CAN_HandleTypeDef *hcan) */
/* { */
/*     can_interrupt_enable(hcan, CAN_INT_WERR | */
/*                         CAN_INT_PERR | */
/*                         CAN_INT_BO | */
/*                         CAN_INT_ERRN | */
/*                         CAN_INT_ERR | */
/*                         CAN_INT_RFNE0 | */
/*                         CAN_INT_RFO0 | */
/*                         CAN_INT_RFF0 | */
/*                         CAN_INT_RFNE1 | */
/*                         CAN_INT_RFO1 | */
/*                         CAN_INT_RFF1 | */
/*                         CAN_INT_TME); */
/* } */

int rt_hw_can_init(void)
{
    struct can_configure config = CANDEFAULTCONFIG;
    config.privmode = RT_CAN_MODE_NOPRIV;
    config.ticks = 50;
#ifdef RT_CAN_USING_HDR
    config.maxhdr = 14;
#ifdef CAN1
    config.maxhdr = 28;
#endif
#endif

    gd32_can_gpio_init();

    /* config default filter */
    can_filter_parameter_struct filter_config = {0};
    can_struct_para_init(CAN_FILTER_STRUCT, &filter_config);

    filter_config.filter_list_high = 0x0000;
    filter_config.filter_list_low = 0x0000;
    filter_config.filter_mask_high = 0x0000;
    filter_config.filter_mask_low = 0x0000;
    filter_config.filter_fifo_number = CAN_FIFO0;
    filter_config.filter_number = 0;
    filter_config.filter_mode = CAN_FILTERMODE_MASK;
    filter_config.filter_bits = CAN_FILTERBITS_32BIT;
    filter_config.filter_enable = ENABLE;

#ifdef BSP_USING_CAN0
    filter_config.filter_number = 0;

    dev_can0.filter_config = filter_config;
    dev_can0.device.config = config;
    /* register CAN1 device */
    rt_hw_can_register(&dev_can0.device,
                       dev_can0.name,
                       &_can_ops,
                       &dev_can0);
#endif /* BSP_USING_CAN0 */

#ifdef BSP_USING_CAN1
    filter_config.filter_number = 14;

    dev_can1.filter_config = filter_config;
    dev_can1.device.config = config;
    /* register CAN2 device */
    rt_hw_can_register(&dev_can1.device,
                       dev_can1.name,
                       &_can_ops,
                       &dev_can1);
#endif /* BSP_USING_CAN1 */

    return 0;
}

INIT_BOARD_EXPORT(rt_hw_can_init);

#endif /* BSP_USING_CAN */
